In [992]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [993]:
df = pd.read_csv("/home/atlantic/dev/censo_1872/planilhas/censo_1872_ce-002_p1.csv")

In [994]:
df.head(10)

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25,Unnamed: 26,Unnamed: 27,Unnamed: 28
0,NaN,NaN,NaN,Raças,NaN,NaN,NaN,Estados civis,NaN,NaN,...,Defeitos físicos,NaN,NaN,NaN,NaN,NaN,NaN,Casas,NaN,NaN
1,Condições,Sexos,Almas,Brancos,Pardos,Pretos,Caboclos,Solteiros,Casados,Viúvos,...,Cegos,Surdo-mudos,Aleijados,Dementes,Alienados,Ausentes,Transeuntes,Habitadas,Desabitadas,Fogos
2,Livres,Homens,10322,4940,4332,436,614,7154,2775,393,...,48,6,158,16,11,41,301,NaN,NaN,NaN
3,NaN,Mulheres,9867,4364,4601,470,432,6979,2097,791,...,41,9,32,21,9,76,247,NaN,NaN,NaN
4,NaN,Soma,20189,9304,8933,906,1046,14133,4872,1184,...,89,15,190,37,20,117,548,3359,1025,3403
5,Escravos,Homens,522,0,326,196,0,502,14,6,...,0,0,2,0,0,0,0,NaN,NaN,NaN
6,NaN,Mulheres,661,0,365,296,0,638,19,4,...,0,0,2,2,2,0,0,NaN,NaN,NaN
7,NaN,Soma,1183,0,691,492,0,1140,33,10,...,0,0,4,2,2,0,0,NaN,NaN,NaN
8,NaN,Soma geral,21372,9304,9624,1398,1046,15273,4905,1194,...,89,15,194,39,22,117,548,3359,1025,3403

In [995]:
print(df.columns)

Index(['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4',
       'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9',
       'Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13', 'Instrução',
       'Unnamed: 15', 'Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18',
       'Unnamed: 19', 'Unnamed: 20', 'Unnamed: 21', 'Unnamed: 22',
       'Unnamed: 23', 'Unnamed: 24', 'Unnamed: 25', 'Unnamed: 26',
       'Unnamed: 27', 'Unnamed: 28'],
      dtype='object')

# almas

In [996]:
almas = df[['Unnamed: 0','Unnamed: 1', 'Unnamed: 2']]
almas.head()

  Unnamed: 0 Unnamed: 1 Unnamed: 2
0        NaN        NaN        NaN
1  Condições      Sexos      Almas
2     Livres     Homens      10322
3        NaN   Mulheres       9867
4        NaN       Soma      20189

In [997]:
new_header = almas.iloc[1]
almas.columns = new_header
almas = almas[2:]
almas.head()

1 Condições     Sexos  Almas
2    Livres    Homens  10322
3       NaN  Mulheres   9867
4       NaN      Soma  20189
5  Escravos    Homens    522
6       NaN  Mulheres    661

# raças

## Clean header

In [998]:
racas = df[['Unnamed: 0','Unnamed: 1', 'Unnamed: 3', 'Unnamed: 4', 'Unnamed: 5', 'Unnamed: 6']]
racas.head()

  Unnamed: 0 Unnamed: 1 Unnamed: 3 Unnamed: 4 Unnamed: 5 Unnamed: 6
0        NaN        NaN      Raças        NaN        NaN        NaN
1  Condições      Sexos    Brancos     Pardos     Pretos   Caboclos
2     Livres     Homens       4940       4332        436        614
3        NaN   Mulheres       4364       4601        470        432
4        NaN       Soma       9304       8933        906       1046

In [999]:
new_header = racas.iloc[1]
racas.columns = new_header
racas = racas[2:]
racas

1 Condições       Sexos Brancos Pardos Pretos Caboclos
2    Livres      Homens    4940   4332    436      614
3       NaN    Mulheres    4364   4601    470      432
4       NaN        Soma    9304   8933    906     1046
5  Escravos      Homens       0    326    196        0
6       NaN    Mulheres       0    365    296        0
7       NaN        Soma       0    691    492        0
8       NaN  Soma geral    9304   9624   1398     1046

In [1000]:
racas.reset_index(drop=True)

1 Condições       Sexos Brancos Pardos Pretos Caboclos
0    Livres      Homens    4940   4332    436      614
1       NaN    Mulheres    4364   4601    470      432
2       NaN        Soma    9304   8933    906     1046
3  Escravos      Homens       0    326    196        0
4       NaN    Mulheres       0    365    296        0
5       NaN        Soma       0    691    492        0
6       NaN  Soma geral    9304   9624   1398     1046

## Sem tranposta

In [1001]:
df_no_transpose = racas.copy()
df_no_transpose.loc[8, "Condições"] = 'Total'
df_no_transpose

1 Condições       Sexos Brancos Pardos Pretos Caboclos
2    Livres      Homens    4940   4332    436      614
3       NaN    Mulheres    4364   4601    470      432
4       NaN        Soma    9304   8933    906     1046
5  Escravos      Homens       0    326    196        0
6       NaN    Mulheres       0    365    296        0
7       NaN        Soma       0    691    492        0
8     Total  Soma geral    9304   9624   1398     1046

In [1002]:
df_no_transpose['Condições'] = df_no_transpose['Condições'].ffill()
df_no_transpose

1 Condições       Sexos Brancos Pardos Pretos Caboclos
2    Livres      Homens    4940   4332    436      614
3    Livres    Mulheres    4364   4601    470      432
4    Livres        Soma    9304   8933    906     1046
5  Escravos      Homens       0    326    196        0
6  Escravos    Mulheres       0    365    296        0
7  Escravos        Soma       0    691    492        0
8     Total  Soma geral    9304   9624   1398     1046

In [1003]:
# df_no_transpose.to_dict("records")

### Com .loc

In [1004]:
numeric_columns = ['Brancos', 'Pardos', 'Pretos', 'Caboclos']
df_no_transpose[numeric_columns] = df_no_transpose[numeric_columns].apply(pd.to_numeric)

# Passo 1: Selecionar as linhas específicas
livres_homens = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Homens')]
escravos_homens = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Escravos') & (df_no_transpose['Sexos'] == 'Homens')]

# Passo 2: Somar os valores das colunas
soma_homens = livres_homens[numeric_columns].sum() + escravos_homens[numeric_columns].sum()

print(soma_homens)

1
Brancos     4940
Pardos      4658
Pretos       632
Caboclos     614
dtype: int64

### Com groupby

In [1005]:
# Passo 2: Converter as colunas com valores numéricos para o tipo `int`
numeric_columns = ['Brancos', 'Pardos', 'Pretos', 'Caboclos']
df_no_transpose[numeric_columns] = df_no_transpose[numeric_columns].apply(pd.to_numeric)

# Passo 3 e 4: Agrupar por 'Condições' e 'Sexos', e somar os valores
grouped = df_no_transpose.groupby(['Condições', 'Sexos']).sum()

print(grouped)

1                     Brancos  Pardos  Pretos  Caboclos
Condições Sexos
Escravos  Homens            0     326     196         0
          Mulheres          0     365     296         0
          Soma              0     691     492         0
Livres    Homens         4940    4332     436       614
          Mulheres       4364    4601     470       432
          Soma           9304    8933     906      1046
Total     Soma geral     9304    9624    1398      1046

In [1006]:
# Selecionar e somar as linhas 'Livres' e 'Escravos' com 'Homens'
livres_homens = grouped.loc[('Livres', 'Homens')]
escravos_homens = grouped.loc[('Escravos', 'Homens')]

# Somar os valores
total_homens = livres_homens + escravos_homens

print(total_homens)

1
Brancos     4940
Pardos      4658
Pretos       632
Caboclos     614
dtype: int64

In [1007]:
# Selecionar e somar as linhas 'Livres' e 'Escravos' com 'Homens'
livres_mulheres = grouped.loc[('Livres', 'Mulheres')]
escravos_mulheres = grouped.loc[('Escravos', 'Mulheres')]

# Somar os valores
total_mulheres = livres_mulheres + escravos_mulheres

print(total_mulheres)

1
Brancos     4364
Pardos      4966
Pretos       766
Caboclos     432
dtype: int64

### gerando gráfico

In [1008]:
grouped = grouped.apply(pd.to_numeric, errors='coerce')
total = grouped.loc[('Total'), :]
escravos = grouped.loc[('Escravos'),:]
livres = grouped.loc[('Livres'),:]
print(total)
total['Brancos']

1           Brancos  Pardos  Pretos  Caboclos
Sexos
Soma geral     9304    9624    1398      1046

Sexos
Soma geral    9304
Name: Brancos, dtype: int64

In [1011]:
# df_concat = pd.concat([total, escravos, livres], axis=0, keys=['Total', 'Escravos', 'Livres'])
df_concat = pd.concat([total, escravos, livres], axis=0)
df_concat.reset_index(inplace=True)
df_concat

1       Sexos  Brancos  Pardos  Pretos  Caboclos
0  Soma geral     9304    9624    1398      1046
1      Homens        0     326     196         0
2    Mulheres        0     365     296         0
3        Soma        0     691     492         0
4      Homens     4940    4332     436       614
5    Mulheres     4364    4601     470       432
6        Soma     9304    8933     906      1046

In [1010]:
def calcular_percentuais(row):
    return {
        'Brancos': (row[('Escravos', 'Brancos')] / row[('Total', 'Brancos')]) * 100,
        'Pardos': (row[('Escravos', 'Pardos')] / row[('Total', 'Pardos')]) * 100,
        'Pretos': (row[('Escravos', 'Pretos')] / row[('Total', 'Pretos')]) * 100,
        'Caboclos': (row[('Escravos', 'Caboclos')] / row[('Total', 'Caboclos')]) * 100
    }
percentuais = df_concat.apply(calcular_percentuais, axis=1)
percentuais

KeyError: 'key of type tuple not found and not a MultiIndex'

## Transposta

In [ ]:
df_transpose = racas.reset_index(drop=True).transpose()
df_transpose

                0         1     2         3         4     5           6
1
Condições  Livres       NaN   NaN  Escravos       NaN   NaN         NaN
Sexos      Homens  Mulheres  Soma    Homens  Mulheres  Soma  Soma geral
Brancos      4940      4364  9304         0         0     0        9304
Pardos       4332      4601  8933       326       365   691        9624
Pretos        436       470   906       196       296   492        1398
Caboclos      614       432  1046         0         0     0        1046

In [ ]:
trans_header = df_transpose.iloc[0]
df_transpose.columns = trans_header
df_transpose

Condições  Livres       NaN   NaN  Escravos       NaN   NaN         NaN
1
Condições  Livres       NaN   NaN  Escravos       NaN   NaN         NaN
Sexos      Homens  Mulheres  Soma    Homens  Mulheres  Soma  Soma geral
Brancos      4940      4364  9304         0         0     0        9304
Pardos       4332      4601  8933       326       365   691        9624
Pretos        436       470   906       196       296   492        1398
Caboclos      614       432  1046         0         0     0        1046

In [ ]:
df_transpose.drop("Condições", inplace=True)
df_transpose

Condições  Livres       NaN   NaN Escravos       NaN   NaN         NaN
1
Sexos      Homens  Mulheres  Soma   Homens  Mulheres  Soma  Soma geral
Brancos      4940      4364  9304        0         0     0        9304
Pardos       4332      4601  8933      326       365   691        9624
Pretos        436       470   906      196       296   492        1398
Caboclos      614       432  1046        0         0     0        1046

In [ ]:
df_transpose.index

Index(['Sexos', 'Brancos', 'Pardos', 'Pretos', 'Caboclos'], dtype='object', name=1)

In [ ]:
df_transpose.columns

Index(['Livres', nan, nan, 'Escravos', nan, nan, nan], dtype='object', name='Condições')

In [ ]:
df_transpose = df_transpose.rename_axis("Condições")
df_transpose.index

Index(['Sexos', 'Brancos', 'Pardos', 'Pretos', 'Caboclos'], dtype='object', name='Condições')

In [ ]:
df_transpose.columns.name = None
print(df_transpose.columns)
df_transpose

Index(['Livres', nan, nan, 'Escravos', nan, nan, nan], dtype='object')

           Livres       NaN   NaN Escravos       NaN   NaN         NaN
Condições
Sexos      Homens  Mulheres  Soma   Homens  Mulheres  Soma  Soma geral
Brancos      4940      4364  9304        0         0     0        9304
Pardos       4332      4601  8933      326       365   691        9624
Pretos        436       470   906      196       296   492        1398
Caboclos      614       432  1046        0         0     0        1046

In [ ]:
df_transpose.reset_index(inplace=True)
df_transpose

  Condições  Livres       NaN   NaN Escravos       NaN   NaN         NaN
0     Sexos  Homens  Mulheres  Soma   Homens  Mulheres  Soma  Soma geral
1   Brancos    4940      4364  9304        0         0     0        9304
2    Pardos    4332      4601  8933      326       365   691        9624
3    Pretos     436       470   906      196       296   492        1398
4  Caboclos     614       432  1046        0         0     0        1046

In [ ]:
transpose_col = ['Condições', 'Livres', 'Livres', 'Livres', 'Escravos', 'Escravos', 'Escravos', 'Todos']
df_transpose.columns = transpose_col
df_transpose

  Condições  Livres    Livres Livres Escravos  Escravos Escravos       Todos
0     Sexos  Homens  Mulheres   Soma   Homens  Mulheres     Soma  Soma geral
1   Brancos    4940      4364   9304        0         0        0        9304
2    Pardos    4332      4601   8933      326       365      691        9624
3    Pretos     436       470    906      196       296      492        1398
4  Caboclos     614       432   1046        0         0        0        1046

In [ ]:
df_transpose.to_dict('records')

/tmp/ipykernel_1138/2711497462.py:1: UserWarning: DataFrame columns are not unique, some columns will be omitted.
  df_transpose.to_dict('records')

[{'Condições': 'Sexos',
  'Livres': 'Soma',
  'Escravos': 'Soma',
  'Todos': 'Soma geral'},
 {'Condições': 'Brancos', 'Livres': '9304', 'Escravos': '0', 'Todos': '9304'},
 {'Condições': 'Pardos', 'Livres': '8933', 'Escravos': '691', 'Todos': '9624'},
 {'Condições': 'Pretos', 'Livres': '906', 'Escravos': '492', 'Todos': '1398'},
 {'Condições': 'Caboclos', 'Livres': '1046', 'Escravos': '0', 'Todos': '1046'}]

## Multi index

In [ ]:
columns = pd.MultiIndex.from_tuples([
    ('Condições', 'Sexos'),
    ('Livres', 'Homens'),
    ('Livres', 'Mulheres'),
    ('Livres', 'Soma'),
    ('Escravos', 'Homens'),
    ('Escravos', 'Mulheres'),
    ('Escravos', 'Soma'),
    ('Todos', 'Soma geral')
])

df_transpose.columns = columns
df_transpose

  Condições  Livres                 Escravos                       Todos
      Sexos  Homens  Mulheres  Soma   Homens  Mulheres  Soma  Soma geral
0     Sexos  Homens  Mulheres  Soma   Homens  Mulheres  Soma  Soma geral
1   Brancos    4940      4364  9304        0         0     0        9304
2    Pardos    4332      4601  8933      326       365   691        9624
3    Pretos     436       470   906      196       296   492        1398
4  Caboclos     614       432  1046        0         0     0        1046

In [ ]:
df_transpose.columns

MultiIndex([('Condições',      'Sexos'),
            (   'Livres',     'Homens'),
            (   'Livres',   'Mulheres'),
            (   'Livres',       'Soma'),
            ( 'Escravos',     'Homens'),
            ( 'Escravos',   'Mulheres'),
            ( 'Escravos',       'Soma'),
            (    'Todos', 'Soma geral')],
           )

In [ ]:
df_transpose = df_transpose.iloc[1:].copy() # Remove a linha de cabeçalho extra
df_transpose

  Condições Livres                Escravos                    Todos
      Sexos Homens Mulheres  Soma   Homens Mulheres Soma Soma geral
1   Brancos   4940     4364  9304        0        0    0       9304
2    Pardos   4332     4601  8933      326      365  691       9624
3    Pretos    436      470   906      196      296  492       1398
4  Caboclos    614      432  1046        0        0    0       1046

## Soma de homens

In [ ]:
# Converter as colunas 'Homens' para tipo numérico
homens_cols = df_transpose.loc[:, [('Livres', 'Homens'), ('Escravos', 'Homens')]].apply(pd.to_numeric)

# Somar os valores
soma_homens = homens_cols.sum(axis=1)
soma_homens

1    4940
2    4658
3     632
4     614
dtype: int64

## Soma de homens por groupby

In [ ]:
df_copy = df_transpose.copy()
df_copy

  Condições Livres                Escravos                    Todos
      Sexos Homens Mulheres  Soma   Homens Mulheres Soma Soma geral
1   Brancos   4940     4364  9304        0        0    0       9304
2    Pardos   4332     4601  8933      326      365  691       9624
3    Pretos    436      470   906      196      296  492       1398
4  Caboclos    614      432  1046        0        0    0       1046

In [ ]:
df_copy.columns

MultiIndex([('Condições',      'Sexos'),
            (   'Livres',     'Homens'),
            (   'Livres',   'Mulheres'),
            (   'Livres',       'Soma'),
            ( 'Escravos',     'Homens'),
            ( 'Escravos',   'Mulheres'),
            ( 'Escravos',       'Soma'),
            (    'Todos', 'Soma geral')],
           )

Uso a coluna `('Condições', 'Sexos'),` como `index`

In [ ]:
df_copy.set_index(('Condições', 'Sexos'), inplace=True)
print(df_copy.columns)
df_copy

MultiIndex([(  'Livres',     'Homens'),
            (  'Livres',   'Mulheres'),
            (  'Livres',       'Soma'),
            ('Escravos',     'Homens'),
            ('Escravos',   'Mulheres'),
            ('Escravos',       'Soma'),
            (   'Todos', 'Soma geral')],
           )

                   Livres                Escravos                    Todos
                   Homens Mulheres  Soma   Homens Mulheres Soma Soma geral
(Condições, Sexos)
Brancos              4940     4364  9304        0        0    0       9304
Pardos               4332     4601  8933      326      365  691       9624
Pretos                436      470   906      196      296  492       1398
Caboclos              614      432  1046        0        0    0       1046

In [ ]:
# df_copy.to_dict('records')

Uma vez que setei `('Condições', 'Sexos')` como ``index``, posso agora usá-los como categoria para o ``groupby``

In [ ]:
# converte de string para int64
df_copy = df_copy.apply(pd.to_numeric)

# Resetar o índice para inserí-lo como a coluna categorias no DataFrame
df_reset = df_copy.reset_index()

# Criar uma coluna de categorias
df_reset['Categoria'] = df_reset[('Condições', 'Sexos')]

# Agrupar por 'Categoria' e somar os valores das colunas 'Homens'
grouped = df_reset.groupby('Categoria').agg({
    ('Livres', 'Homens'): 'sum',
    ('Escravos', 'Homens'): 'sum'
})

# Somar os valores totais de Homens por Categoria
grouped['Total Homens'] = grouped.sum(axis=1) # axis=1 executa por coluna

print(grouped)

          Livres Escravos Total Homens
          Homens   Homens
Categoria
Brancos     4940        0         4940
Caboclos     614        0          614
Pardos      4332      326         4658
Pretos       436      196          632

### Como usar groupby

In [ ]:
group_names = ["Condições", "Sexos"]

group_cond = racas.groupby("Condições", as_index=False)
print(group_cond.ngroups)
group_sex = racas.groupby("Sexos", as_index=False)
print(group_sex)

2
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7f051a7b8ca0>

In [ ]:
g1 = group_cond.get_group("Livres")
g1

1 Condições   Sexos Brancos Pardos Pretos Caboclos
2    Livres  Homens    4940   4332    436      614

In [ ]:
g2 = group_cond.get_group("Escravos")
g2

1 Condições   Sexos Brancos Pardos Pretos Caboclos
5  Escravos  Homens       0    326    196        0

In [ ]:
df_g_cond = pd.concat([g1, g2], axis=0)
df_g_cond

1 Condições   Sexos Brancos Pardos Pretos Caboclos
2    Livres  Homens    4940   4332    436      614
5  Escravos  Homens       0    326    196        0

## Função generalizada

In [ ]:
def clean_header(df):
    # fatia a linha do novo header
    new_header = df.iloc[1] 
    df.columns = new_header 
    
    # apaga as linhas repetidas
    df = df[2:]
    return df

def prepoc_index_cols(df):
    # Inverte linha com coluna
    df_transpose = df.reset_index(drop=True).transpose()
    
    # Pega o a linha de 'Condições' para header mais externo
    trans_header = df_transpose.iloc[0] 
    df_transpose.columns = trans_header
    
    # Remove 'Condições' antiga
    df_transpose.drop("Condições", inplace=True)
    
    # Reorganiza index e coluna devido a transposta 
    df_transpose = df_transpose.rename_axis("Condições") 
    df_transpose.columns.name = None

    # Renomeia as colunas do df, talvez deva receber essa lista externa
    transpose_col = ['Condições', 'Livres', 'Livres', 'Livres', 'Escravos', 'Escravos', 'Escravos', 'Todos']
    df_transpose.columns = transpose_col

    # Usa tuplas para facilitar a seleção
    columns = pd.MultiIndex.from_tuples([
        ('Condições', 'Sexos'),
        ('Livres', 'Homens'),
        ('Livres', 'Mulheres'),
        ('Livres', 'Soma'),
        ('Escravos', 'Homens'),
        ('Escravos', 'Mulheres'),
        ('Escravos', 'Soma'),
        ('Todos', 'Soma geral')
    ])

    df_transpose.columns = columns
    
    # Remove a linha de cabeçalho extra
    df_transpose = df_transpose.iloc[1:].copy() 

def calc_sum_by_cond_sex(df, each_sex:str):
    # converte de string para int64
    df = df.apply(pd.to_numeric)
    
    # Reseta o índice para inserí-lo como nova coluna
    df_reset = df.reset_index()
    
    # Criar uma coluna de categorias e insere o antigo index
    df_reset['Categoria'] = df_reset[('Condições', 'Sexos')]
    
    # Agrupa por 'Categoria' e agrega os valores das colunas 'Homens' por sua soma
    grouped = df_reset.groupby('Categoria').agg({
        ('Livres', 'Homens'): 'sum',
        ('Escravos', 'Homens'): 'sum'
    })
    
    # Somar os valores totais de Homens por Categoria
    grouped['Total Homens'] = grouped.sum(axis=1) # axis=1 executa por coluna
    
    print(grouped)
    return grouped

# estados civis

In [ ]:
estados_civis = df[['Unnamed: 0','Unnamed: 1', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9']]
print(estados_civis.index)
print(estados_civis.columns)
estados_civis

RangeIndex(start=0, stop=9, step=1)
Index(['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9'], dtype='object')

  Unnamed: 0  Unnamed: 1     Unnamed: 7 Unnamed: 8 Unnamed: 9
0        NaN         NaN  Estados civis        NaN        NaN
1  Condições       Sexos      Solteiros    Casados     Viúvos
2     Livres      Homens           7154       2775        393
3        NaN    Mulheres           6979       2097        791
4        NaN        Soma          14133       4872       1184
5   Escravos      Homens            502         14          6
6        NaN    Mulheres            638         19          4
7        NaN        Soma           1140         33         10
8        NaN  Soma geral          15273       4905       1194

In [ ]:
new_header = estados_civis.iloc[1]
estados_civis.columns = new_header
estados_civis = estados_civis[2:]
print(estados_civis.shape)
estados_civis

(7, 5)

1 Condições       Sexos Solteiros Casados Viúvos
2    Livres      Homens      7154    2775    393
3       NaN    Mulheres      6979    2097    791
4       NaN        Soma     14133    4872   1184
5  Escravos      Homens       502      14      6
6       NaN    Mulheres       638      19      4
7       NaN        Soma      1140      33     10
8       NaN  Soma geral     15273    4905   1194

In [ ]:
print(estados_civis.index)
print(estados_civis.columns)
estados_civis.reset_index(drop=True, inplace=True)
estados_civis.transpose()

RangeIndex(start=2, stop=9, step=1)
Index(['Condições', 'Sexos', 'Solteiros', 'Casados', 'Viúvos'], dtype='object', name=1)

                0         1      2         3         4     5           6
1
Condições  Livres       NaN    NaN  Escravos       NaN   NaN         NaN
Sexos      Homens  Mulheres   Soma    Homens  Mulheres  Soma  Soma geral
Solteiros    7154      6979  14133       502       638  1140       15273
Casados      2775      2097   4872        14        19    33        4905
Viúvos        393       791   1184         6         4    10        1194

# religião

In [ ]:
religiao = df[['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 10', 'Unnamed: 11']]
religiao.head()

  Unnamed: 0 Unnamed: 1 Unnamed: 10 Unnamed: 11
0        NaN        NaN    Religião         NaN
1  Condições      Sexos   Católicos  Acatólicos
2     Livres     Homens       10288          34
3        NaN   Mulheres        9859           8
4        NaN       Soma       20147          42

In [ ]:
religiao_header = religiao.iloc[1]
religiao.columns = religiao_header
religiao = religiao[2:]
religiao.head()

1 Condições     Sexos Católicos Acatólicos
2    Livres    Homens     10288         34
3       NaN  Mulheres      9859          8
4       NaN      Soma     20147         42
5  Escravos    Homens       522          0
6       NaN  Mulheres       661          0

# nacionalidaes

In [ ]:
nacionalidades = df[['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 12', 'Unnamed: 13']]
nacionalidades.head()

  Unnamed: 0 Unnamed: 1     Unnamed: 12   Unnamed: 13
0        NaN        NaN  Nacionalidades           NaN
1  Condições      Sexos     Brasileiros  Estrangeiros
2     Livres     Homens            9779           543
3        NaN   Mulheres            9661           206
4        NaN       Soma           19440           749

In [ ]:
nacionalidades_header = nacionalidades.iloc[1]
nacionalidades.columns = nacionalidades_header
nacionalidades = nacionalidades[2:]
nacionalidades.head()

1 Condições     Sexos Brasileiros Estrangeiros
2    Livres    Homens        9779          543
3       NaN  Mulheres        9661          206
4       NaN      Soma       19440          749
5  Escravos    Homens         522            0
6       NaN  Mulheres         661            0

# Instrução

In [ ]:
instrucao = df[['Unnamed: 0', 'Unnamed: 1', 'Instrução', 'Unnamed: 15', 'Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18']]
instrucao.head()

,Unnamed: 0,Unnamed: 1,Instrução,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18
0,NaN,NaN,NaN,NaN,População escolar de 6 a 15 anos,NaN,NaN
1,Condições,Sexos,Sabem ler e escrever,Analfabetos,Frequentam escolas,Não frequentam escolas,Total
2,Livres,Homens,3266,7056,799,1711,2510
3,NaN,Mulheres,1170,8697,559,1896,2455
4,NaN,Soma,4436,15753,1358,3607,4965

In [ ]:
instrucao_header = instrucao.iloc[0]
instrucao.columns = instrucao_header
instrucao = instrucao[1:]
instrucao.head()

,NaN,NaN,NaN,NaN,População escolar de 6 a 15 anos,NaN,NaN
1,Condições,Sexos,Sabem ler e escrever,Analfabetos,Frequentam escolas,Não frequentam escolas,Total
2,Livres,Homens,3266,7056,799,1711,2510
3,NaN,Mulheres,1170,8697,559,1896,2455
4,NaN,Soma,4436,15753,1358,3607,4965
5,Escravos,Homens,5,517,0,0,0

# Deficientes

In [ ]:
deficientes = df[['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 19', 'Unnamed: 20', 'Unnamed: 21', 'Unnamed: 22', 'Unnamed: 23']]
deficientes.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23
0,NaN,NaN,Defeitos físicos,NaN,NaN,NaN,NaN
1,Condições,Sexos,Cegos,Surdo-mudos,Aleijados,Dementes,Alienados
2,Livres,Homens,48,6,158,16,11
3,NaN,Mulheres,41,9,32,21,9
4,NaN,Soma,89,15,190,37,20

In [ ]:
new_header = deficientes.iloc[1]
deficientes.columns = new_header
deficientes = deficientes[2:]
deficientes.head()

1 Condições     Sexos Cegos Surdo-mudos Aleijados Dementes Alienados
2    Livres    Homens    48           6       158       16        11
3       NaN  Mulheres    41           9        32       21         9
4       NaN      Soma    89          15       190       37        20
5  Escravos    Homens     0           0         2        0         0
6       NaN  Mulheres     0           0         2        2         2

# Ausentes

In [ ]:
ausentes = df[['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 24']]
ausentes.head()

  Unnamed: 0 Unnamed: 1 Unnamed: 24
0        NaN        NaN         NaN
1  Condições      Sexos    Ausentes
2     Livres     Homens          41
3        NaN   Mulheres          76
4        NaN       Soma         117

In [ ]:
new_header = ausentes.iloc[1]
ausentes.columns = new_header
ausentes = ausentes[2:]
ausentes.head()

1 Condições     Sexos Ausentes
2    Livres    Homens       41
3       NaN  Mulheres       76
4       NaN      Soma      117
5  Escravos    Homens        0
6       NaN  Mulheres        0

In [ ]:
transeuntes = df[['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 25']]
transeuntes.head()

  Unnamed: 0 Unnamed: 1  Unnamed: 25
0        NaN        NaN          NaN
1  Condições      Sexos  Transeuntes
2     Livres     Homens          301
3        NaN   Mulheres          247
4        NaN       Soma          548

In [ ]:
new_header = transeuntes.iloc[1]
transeuntes.columns = new_header
transeuntes = transeuntes[2:]
transeuntes.head()

1 Condições     Sexos Transeuntes
2    Livres    Homens         301
3       NaN  Mulheres         247
4       NaN      Soma         548
5  Escravos    Homens           0
6       NaN  Mulheres           0

In [ ]:
casas = df[['Unnamed: 1', 'Unnamed: 26', 'Unnamed: 27']]
casas.head()

  Unnamed: 1 Unnamed: 26  Unnamed: 27
0        NaN       Casas          NaN
1      Sexos   Habitadas  Desabitadas
2     Homens         NaN          NaN
3   Mulheres         NaN          NaN
4       Soma        3359         1025

In [ ]:
new_header = casas.iloc[1]
casas.columns = new_header
casas = casas[2:]
casas.head()

1     Sexos Habitadas Desabitadas
2    Homens       NaN         NaN
3  Mulheres       NaN         NaN
4      Soma      3359        1025
5    Homens       NaN         NaN
6  Mulheres       NaN         NaN

In [ ]:
fogos = df[['Unnamed: 1', 'Unnamed: 28']]
fogos.head()

  Unnamed: 1 Unnamed: 28
0        NaN         NaN
1      Sexos       Fogos
2     Homens         NaN
3   Mulheres         NaN
4       Soma        3403

In [ ]:
new_header = fogos.iloc[1]
fogos.columns = new_header
fogos = fogos[2:]
fogos.head()

1     Sexos Fogos
2    Homens   NaN
3  Mulheres   NaN
4      Soma  3403
5    Homens   NaN
6  Mulheres   NaN